module Game {
    export class DPanelRate {

        public static DATA: string[][][] = [
            [["1千", "5/10 盲注"], ["2千", "10/20 盲注"], ["5千", "25/50 盲注"], ["1万", "50/100 盲注"]],
            [["4万", "200/400 盲注"], ["10万", "500/1000 盲注"], ["20万", "1千/2千 盲注"], ["40万", "2千/4千 盲注"]],
            [["100万", "5千/1万 盲注"], ["200万", "1万/2万 盲注"], ["400万", "2万/4万 盲注"], ["800万", "4万/8万 盲注"]]
        ];

        public static DATA_NUMBER = {
            "1001": 1000,
            "1002": 2000,
            "1003": 5000,
            "1004": 10000,
            "1005": 40000,
            "1006": 100000,
            "1007": 200000,
            "1008": 400000,
            "1009": 1000000,
            "1010": 2000000,
            "1011": 4000000,
            "1012": 8000000
        };

        public constructor() {
            
        }

        //--------------------------------------------------------------------------------
        public static getTableData(value:number): string[][]
        {
            return this.DATA[value - 1];
        }
    }
}